Tekla.Structures.ModelInternal.dotIntegerIdList_t
Struct for transfering integer ids

Tekla.Structures.ModelInternal.dotIntegerIdList_t.TransactionId
The transaction id

Tekla.Structures.ModelInternal.dotIntegerIdList_t.totalNumber
Number of objects in total

Tekla.Structures.ModelInternal.dotIntegerIdList_t.nObjects
Number of objects

Tekla.Structures.ModelInternal.dotIntegerIdList_t.aObjectIDs
IDs